Revit 2027 API
BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcementWarn Property
 Can't find a host for Area Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceAreaReinforcementWarn { get; }
Public Shared ReadOnly Property CannotPlaceAreaReinforcementWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceAreaReinforcementWarn {
	FailureDefinitionId^ get ();
}
static member CannotPlaceAreaReinforcementWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace